{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 15591], "name": "inputs", "sparse": false}, "inbound_nodes": [], "name": "inputs"}, {"class_name": "Diagonal", "config": {"name": "h0", "dtype": "float32", "activation": "tanh", "trainable": true, "units": 15591, "batch_input_shape": [null, 15591], "use_bias": true}, "inbound_nodes": [[["inputs", 0, 0, {}]]], "name": "h0"}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_0"}, "inbound_nodes": [[["h0", 0, 0, {"training": false}]]], "name": "dropout_0"}, {"class_name": "SparseTF", "config": {"W_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_in"}}, "name": "h1", "bias_regularizer": null, "activation": "tanh", "trainable": true, "nonzero_ind": [[0, 216], [0, 263], [0, 681], [0, 706], [0, 768], [0, 1062], [0, 1065], [1, 1237], [2, 41], [3, 1283], [4, 570], [4, 1123], [5, 1269], [8, 359], [10, 69], [10, 115], [10, 232], [10, 388], [10, 428], [10, 573], [10, 771], [10, 879], [10, 985], [10, 1098], [10, 1111], [10, 1176], [11, 919], [12, 633], [12, 787], [12, 1295], [13, 599], [13, 631], [14, 384], [14, 419], [14, 1076], [14, 1117], [14, 1377], [16, 1207], [17, 229], [18, 453], [18, 1331], [19, 113], [19, 1126], [20, 461], [20, 574], [20, 1342], [22, 757], [22, 788], [22, 845], [23, 195], [24, 146], [25, 1342], [26, 247], [26, 1021], [28, 967], [29, 132], [29, 485], [29, 725], [30, 124], [30, 347], [30, 747], [31, 141], [33, 185], [33, 1079], [34, 184], [35, 1], [35, 94], [35, 943], [35, 973], [35, 985], [36, 266], [36, 787], [36, 1087], [37, 359], [39, 145], [40, 454], [40, 758], [40, 815], [40, 848], [40, 929], [40, 945], [40, 1140], [40, 1235], [41, 810], [42, 363], [43, 849], [44, 365], [44, 1238], [45, 1301], [46, 217], [47, 376], [47, 419], [47, 550], [47, 651], [47, 814], [47, 897], [47, 938], [47, 1004], [47, 1091], [47, 1161], [49, 158], [49, 1236], [50, 1331], [51, 533], [52, 407], [52, 551], [54, 185], [54, 705], [54, 1097], [55, 477], [55, 741], [55, 784], [56, 531], [57, 461], [57, 1157], [59, 619], [59, 982], [60, 528], [61, 791], [61, 1293], [62, 764], [62, 1059], [63, 119], [63, 124], [63, 347], [63, 480], [63, 747], [63, 896], [64, 62], [64, 616], [64, 830], [65, 88], [65, 496], [65, 687], [65, 761], [65, 1348], [66, 155], [68, 1018], [69, 452], [69, 505], [69, 857], [69, 985], [70, 23], [70, 346], [70, 804], [70, 969], [70, 1034], [70, 1256], [71, 453], [71, 1331], [72, 581], [72, 603], [74, 975], [74, 1314], [75, 804], [75, 1256], [76, 1118], [77, 1273], [78, 461], [78, 1157], [78, 1342], [79, 1251], [80, 1024], [81, 7], [81, 117], [81, 355], [81, 402], [81, 649], [81, 782], [82, 742], [83, 49], [83, 1171], [84, 421], [84, 422], [85, 1165], [87, 322], [88, 862], [89, 1097], [90, 221], [90, 519], [90, 691], [92, 424], [92, 425], [92, 728], [92, 890], [92, 903], [92, 979], [92, 980], [92, 998], [92, 1014], [92, 1060], [93, 1049], [94, 1042], [95, 14], [95, 41], [95, 44], [95, 49], [95, 53], [95, 92], [95, 94], [95, 119], [95, 132], [95, 144], [95, 153], [95, 185], [95, 187], [95, 193], [95, 225], [95, 232], [95, 237], [95, 249], [95, 251], [95, 259], [95, 266], [95, 270], [95, 279], [95, 306], [95, 309], [95, 355], [95, 357], [95, 383], [95, 402], [95, 417], [95, 448], [95, 449], [95, 451], [95, 454], [95, 476], [95, 480], [95, 482], [95, 484], [95, 495], [95, 516], [95, 523], [95, 550], [95, 559], [95, 561], [95, 581], [95, 585], [95, 592], [95, 603], [95, 604], [95, 634], [95, 635], [95, 637], [95, 640], [95, 697], [95, 699], [95, 745], [95, 746], [95, 749], [95, 761], [95, 771], [95, 786], [95, 790], [95, 803], [95, 816], [95, 829], [95, 833], [95, 835], [95, 869], [95, 871], [95, 873], [95, 875], [95, 877], [95, 884], [95, 886], [95, 887], [95, 890], [95, 896], [95, 911], [95, 931], [95, 933], [95, 943], [95, 973], [95, 985], [95, 989], [95, 990], [95, 991], [95, 992], [95, 1011], [95, 1014], [95, 1015], [95, 1023], [95, 1037], [95, 1081], [95, 1087], [95, 1091], [95, 1098], [95, 1104], [95, 1109], [95, 1111], [95, 1112], [95, 1118], [95, 1119], [95, 1120], [95, 1121], [95, 1140], [95, 1171], [95, 1172], [95, 1174], [95, 1192], [95, 1208], [95, 1209], [95, 1219], [95, 1229], [95, 1250], [95, 1256], [95, 1263], [95, 1289], [95, 1365], [95, 1370], [95, 1372], [95, 1382], [96, 146], [97, 1248], [98, 483], [99, 124], [99, 347], [99, 747], [100, 633], [101, 1123], [103, 585], [104, 1070], [105, 753], [106, 495], [106, 992], [107, 475], [107, 1094], [109, 365], [110, 305], [111, 320], [111, 783], [111, 1165], [112, 1231], [114, 1030], [115, 1183], [116, 365], [116, 611], [116, 1183], [117, 1036], [118, 351], [118, 727], [120, 349], [120, 419], [120, 651], [120, 671], [120, 823], [121, 89], [121, 90], [121, 562], [121, 668], [121, 739], [121, 765], [121, 926], [121, 1009], [121, 1171], [121, 1288], [121, 1331], [121, 1361], [122, 365], [123, 816], [124, 533], [125, 179], [125, 550], [125, 1001], [125, 1003], [125, 1004], [125, 1005], [125, 1006], [125, 1016], [125, 1080], [125, 1081], [125, 1091], [126, 461], [126, 1157], [126, 1342], [127, 4], [128, 453], [128, 1331], [129, 25], [129, 159], [129, 188], [130, 1170], [133, 22], [133, 730], [133, 827], [133, 877], [133, 1349], [134, 474], [135, 819], [136, 1331], [137, 457], [137, 651], [137, 986], [137, 1015], [137, 1085], [137, 1244], [137, 1367], [138, 188], [138, 201], [138, 362], [138, 993], [139, 633], [139, 797], [139, 1295], [140, 217], [142, 841], [143, 88], [143, 419], [143, 459], [143, 496], [143, 600], [143, 668], [143, 687], [143, 735], [143, 753], [143, 761], [143, 861], [143, 1341], [143, 1342], [143, 1348], [143, 1351], [143, 1363], [143, 1364], [144, 146], [146, 825], [147, 317], [147, 631], [148, 1178], [148, 1345], [149, 153], [149, 749], [149, 816], [149, 1015], [150, 303], [150, 951], [151, 51], [151, 844], [151, 1216], [152, 62], [152, 222], [152, 227], [152, 407], [152, 477], [152, 551], [152, 607], [152, 630], [152, 686], [152, 819], [152, 820], [152, 830], [152, 864], [152, 894], [152, 895], [152, 1137], [152, 1204], [152, 1284], [152, 1311], [153, 571], [153, 1366], [155, 168], [155, 870], [157, 956], [157, 1032], [158, 747], [160, 1055], [161, 377], [161, 518], [161, 690], [161, 1047], [162, 495], [162, 816], [163, 679], [164, 1342], [165, 1109], [167, 477], [167, 686], [167, 894], [167, 1054], [167, 1056], [167, 1131], [167, 1284], [169, 1273], [170, 1342], [171, 365], [171, 417], [171, 1165], [172, 124], [172, 347], [172, 747], [173, 356], [174, 365], [174, 862], [175, 356], [175, 567], [175, 641], [175, 659], [175, 662], [175, 664], [175, 667], [175, 668], [175, 717], [175, 732], [175, 761], [175, 811], [175, 832], [175, 833], [175, 877], [175, 896], [175, 953], [175, 1151], [175, 1155], [175, 1157], [175, 1221], [175, 1252], [175, 1267], [175, 1271], [175, 1272], [175, 1307], [177, 979], [177, 1275], [178, 897], [178, 911], [179, 696], [180, 157], [181, 882], [182, 1377], [183, 1210], [184, 124], [184, 347], [184, 747], [185, 550], [185, 1161], [186, 1255], [187, 232], [187, 428], [187, 514], [187, 771], [187, 985], [187, 1098], [187, 1111], [188, 1027], [189, 266], [191, 510], [191, 511], [191, 602], [191, 748], [192, 7], [192, 117], [192, 402], [192, 649], [192, 782], [193, 365], [193, 1255], [194, 63], [194, 1025], [195, 27], [195, 651], [195, 728], [196, 1269], [197, 229], [197, 862], [198, 633], [198, 773], [198, 831], [198, 1386], [200, 728], [203, 322], [204, 365], [204, 828], [206, 836], [208, 157], [208, 964], [208, 966], [209, 92], [209, 670], [209, 1011], [209, 1208], [210, 365], [211, 365], [212, 187], [212, 251], [212, 603], [212, 604], [212, 745], [212, 816], [212, 884], [212, 890], [212, 1015], [212, 1098], [214, 744], [214, 1295], [215, 572], [216, 1331], [217, 808], [218, 717], [218, 1307], [219, 278], [219, 1165], [220, 41], [221, 461], [221, 1157], [221, 1342], [222, 984], [224, 919], [225, 30], [225, 95], [225, 125], [225, 128], [225, 1077], [225, 1336], [226, 352], [226, 985], [227, 828], [227, 1120], [228, 911], [229, 365], [230, 1027], [231, 528], [233, 607], [233, 1137], [235, 134], [235, 280], [235, 690], [235, 1287], [236, 201], [237, 911], [238, 42], [239, 485], [239, 725], [240, 267], [241, 168], [241, 870], [242, 964], [242, 966], [243, 174], [243, 175], [244, 656], [245, 146], [245, 843], [245, 941], [245, 1329], [249, 657], [250, 262], [251, 322], [252, 472], [253, 189], [255, 624], [255, 651], [255, 840], [255, 1070], [256, 1100], [257, 173], [258, 1240], [259, 982], [262, 296], [264, 217], [265, 33], [265, 55], [265, 251], [265, 276], [265, 310], [265, 909], [265, 1098], [265, 1174], [265, 1268], [266, 188], [267, 696], [268, 846], [269, 757], [269, 788], [269, 845], [270, 266], [270, 383], [270, 1087], [271, 911], [272, 412], [274, 1015], [275, 937], [276, 113], [276, 214], [276, 593], [276, 1126], [277, 1237], [278, 673], [278, 876], [278, 1147], [278, 1275], [279, 31], [279, 1353], [280, 14], [280, 49], [280, 53], [280, 94], [280, 132], [280, 153], [280, 187], [280, 193], [280, 225], [280, 249], [280, 355], [280, 357], [280, 383], [280, 413], [280, 417], [280, 448], [280, 449], [280, 451], [280, 454], [280, 476], [280, 495], [280, 523], [280, 585], [280, 634], [280, 697], [280, 699], [280, 745], [280, 746], [280, 749], [280, 816], [280, 875], [280, 877], [280, 890], [280, 911], [280, 933], [280, 943], [280, 1015], [280, 1023], [280, 1087], [280, 1091], [280, 1140], [280, 1171], [280, 1229], [280, 1332], [280, 1372], [281, 834], [281, 1385], [283, 562], [284, 247], [284, 267], [284, 275], [284, 512], [284, 540], [284, 622], [284, 778], [284, 1082], [284, 1283], [285, 1074], [286, 495], [286, 992], [287, 1059], [288, 967], [289, 783], [289, 1360], [290, 872], [291, 581], [291, 603], [292, 14], [292, 49], [292, 53], [292, 94], [292, 132], [292, 153], [292, 187], [292, 193], [292, 225], [292, 249], [292, 355], [292, 357], [292, 383], [292, 413], [292, 417], [292, 448], [292, 449], [292, 451], [292, 454], [292, 476], [292, 495], [292, 523], [292, 585], [292, 634], [292, 697], [292, 699], [292, 745], [292, 746], [292, 749], [292, 816], [292, 875], [292, 877], [292, 890], [292, 911], [292, 933], [292, 943], [292, 1015], [292, 1023], [292, 1087], [292, 1091], [292, 1140], [292, 1171], [292, 1229], [292, 1332], [292, 1372], [293, 119], [293, 480], [293, 896], [294, 1342], [295, 296], [296, 1205], [297, 1070], [298, 973], [298, 1207], [299, 365], [299, 425], [299, 737], [299, 851], [300, 679], [302, 1269], [302, 1346], [303, 816], [304, 81], [304, 100], [304, 973], [304, 1247], [305, 49], [305, 746], [305, 1023], [306, 794], [306, 809], [306, 1385], [307, 474], [310, 630], [310, 1070], [311, 306], [311, 761], [311, 877], [312, 967], [313, 62], [313, 217], [313, 222], [313, 227], [313, 407], [313, 445], [313, 477], [313, 551], [313, 607], [313, 630], [313, 686], [313, 819], [313, 820], [313, 830], [313, 864], [313, 894], [313, 895], [313, 1137], [313, 1204], [313, 1284], [313, 1311], [315, 54], [316, 1012], [317, 362], [318, 606], [318, 658], [318, 687], [318, 1148], [318, 1253], [318, 1265], [319, 570], [319, 1342], [320, 7], [320, 117], [320, 402], [320, 649], [320, 782], [320, 1094], [320, 1331], [322, 391], [322, 477], [322, 634], [322, 636], [323, 777], [324, 1018], [326, 30], [326, 1077], [327, 862], [328, 63], [329, 8], [329, 446], [330, 1182], [331, 1007], [333, 62], [333, 1024], [334, 229], [335, 1074], [336, 1119], [336, 1273], [337, 1151], [338, 775], [339, 526], [339, 776], [340, 243], [340, 1025], [341, 362], [341, 425], [341, 487], [341, 851], [341, 1230], [341, 1242], [342, 293], [342, 503], [342, 622], [343, 25], [343, 362], [343, 1152], [345, 1059], [346, 1110], [347, 4], [348, 536], [349, 309], [349, 516], [349, 803], [349, 991], [350, 320], [350, 783], [350, 1165], [351, 404], [351, 854], [353, 92], [353, 670], [353, 1011], [353, 1208], [354, 64], [354, 75], [354, 985], [354, 1237], [355, 866], [356, 1018], [357, 725], [359, 753], [360, 114], [360, 184], [360, 580], [360, 681], [361, 1342], [362, 723], [363, 69], [363, 115], [363, 232], [363, 365], [363, 388], [363, 428], [363, 552], [363, 573], [363, 771], [363, 820], [363, 879], [363, 985], [363, 1098], [363, 1111], [363, 1176], [364, 1070], [365, 818], [365, 985], [365, 987], [366, 1382], [367, 40], [367, 1064], [370, 1270], [371, 362], [372, 1015], [373, 7], [373, 117], [373, 355], [373, 402], [373, 649], [373, 782], [374, 1342], [375, 65], [375, 81], [375, 486], [375, 1188], [375, 1247], [375, 1282], [376, 1237], [377, 488], [377, 607], [378, 404], [379, 581], [380, 630], [380, 820], [380, 830], [380, 894], [380, 895], [380, 1054], [380, 1056], [381, 816], [381, 1015], [382, 728], [383, 247], [385, 827], [386, 359], [387, 226], [388, 158], [389, 516], [389, 566], [389, 581], [389, 803], [389, 991], [390, 75], [390, 272], [390, 338], [390, 499], [390, 500], [390, 535], [390, 546], [390, 734], [390, 755], [390, 1016], [390, 1104], [390, 1113], [391, 1070], [392, 821], [392, 895], [392, 910], [392, 1007], [392, 1180], [394, 730], [395, 705], [396, 504], [397, 226], [398, 25], [398, 27], [398, 247], [398, 267], [398, 275], [398, 512], [398, 540], [398, 622], [398, 778], [398, 1082], [398, 1118], [398, 1226], [398, 1283], [399, 245], [400, 403], [400, 582], [400, 1179], [400, 1230], [401, 1381], [402, 829], [403, 380], [403, 419], [403, 766], [403, 1207], [403, 1212], [404, 1248], [405, 309], [405, 816], [405, 992], [405, 1014], [406, 38], [407, 816], [407, 1015], [408, 919], [409, 229], [409, 472], [409, 782], [409, 783], [410, 572], [411, 464], [411, 825], [411, 831], [411, 1146], [411, 1198], [412, 956], [412, 1032], [414, 365], [415, 1283], [416, 745], [417, 22], [417, 100], [417, 827], [417, 877], [417, 1349], [418, 787], [418, 860], [419, 296], [419, 421], [419, 423], [422, 957], [423, 725], [424, 526], [424, 776], [425, 35], [425, 462], [425, 463], [425, 997], [425, 1202], [425, 1357], [426, 22], [426, 185], [426, 474], [426, 632], [426, 817], [426, 827], [426, 831], [426, 877], [426, 1071], [426, 1295], [426, 1349], [428, 1074], [430, 604], [431, 964], [431, 966], [433, 7], [433, 117], [433, 362], [433, 402], [433, 649], [433, 782], [433, 821], [433, 877], [433, 910], [433, 1225], [434, 1099], [435, 903], [435, 980], [436, 863], [437, 998], [438, 356], [438, 567], [438, 641], [438, 659], [438, 662], [438, 664], [438, 667], [438, 668], [438, 717], [438, 732], [438, 761], [438, 811], [438, 832], [438, 833], [438, 877], [438, 896], [438, 953], [438, 1151], [438, 1155], [438, 1157], [438, 1221], [438, 1252], [438, 1267], [438, 1271], [438, 1272], [438, 1307], [439, 63], [439, 243], [439, 1025], [440, 222], [440, 607], [440, 819], [440, 1043], [440, 1137], [440, 1204], [441, 825], [441, 911], [441, 1198], [442, 609], [443, 44], [443, 144], [443, 232], [443, 428], [443, 771], [443, 890], [443, 930], [443, 1098], [444, 495], [444, 1037], [445, 365], [447, 124], [447, 347], [447, 747], [448, 365], [449, 188], [450, 173], [450, 174], [450, 389], [451, 962], [453, 365], [453, 1183], [454, 309], [454, 516], [454, 635], [454, 1342], [455, 457], [456, 209], [456, 847], [458, 296], [458, 744], [460, 657], [461, 50], [463, 1097], [464, 365], [464, 862], [465, 1331], [470, 728], [471, 76], [471, 78], [471, 162], [471, 391], [471, 508], [471, 613], [471, 689], [471, 831], [471, 846], [471, 1014], [471, 1061], [471, 1073], [472, 723], [472, 735], [472, 761], [472, 985], [472, 1348], [472, 1363], [472, 1364], [473, 1256], [474, 135], [475, 1358], [476, 320], [476, 425], [476, 1165], [477, 145], [477, 624], [477, 872], [477, 879], [477, 965], [477, 1331], [478, 1054], [479, 63], [479, 478], [480, 821], [480, 877], [480, 910], [480, 962], [480, 1225], [481, 19], [483, 728], [484, 404], [485, 990], [486, 31], [486, 429], [486, 1353], [487, 787], [488, 1344], [489, 69], [489, 299], [489, 370], [489, 425], [489, 695], [489, 1003], [489, 1138], [489, 1181], [490, 229], [490, 365], [490, 862], [491, 365], [491, 728], [492, 184], [493, 657], [493, 689], [493, 772], [494, 1015], [495, 1230], [496, 1070], [498, 45], [498, 89], [498, 90], [498, 562], [498, 620], [498, 668], [498, 739], [498, 765], [498, 926], [498, 1009], [498, 1171], [498, 1279], [498, 1288], [498, 1331], [498, 1361], [499, 21], [499, 191], [499, 192], [499, 193], [499, 376], [499, 605], [499, 729], [499, 938], [499, 1190], [499, 1333], [500, 1347], [501, 1124], [502, 1270], [503, 1], [503, 41], [503, 439], [503, 476], [503, 671], [503, 724], [503, 879], [503, 967], [503, 974], [503, 1165], [504, 404], [504, 1337], [505, 937], [506, 656], [506, 820], [507, 65], [507, 81], [507, 486], [507, 1188], [507, 1247], [507, 1282], [508, 1331], [509, 178], [509, 370], [509, 425], [509, 629], [509, 682], [509, 737], [509, 851], [509, 1175], [510, 132], [510, 425], [510, 550], [510, 566], [510, 730], [510, 737], [510, 973], [510, 1236], [511, 1356], [512, 753], [513, 1273], [514, 1168], [514, 1262], [515, 114], [515, 706], [515, 768], [515, 839], [517, 341], [517, 495], [517, 709], [517, 779], [517, 1028], [517, 1029], [517, 1037], [517, 1119], [518, 962], [519, 188], [519, 651], [519, 825], [519, 846], [519, 911], [519, 1198], [520, 41], [521, 862], [522, 2], [522, 209], [522, 272], [522, 487], [522, 796], [522, 850], [523, 257], [524, 482], [524, 484], [524, 516], [524, 531], [524, 566], [524, 635], [524, 790], [524, 803], [524, 869], [524, 871], [524, 873], [524, 916], [524, 929], [524, 985], [524, 989], [524, 1046], [524, 1219], [524, 1365], [525, 453], [525, 1331], [526, 777], [526, 881], [527, 168], [527, 870], [528, 485], [528, 725], [529, 242], [529, 551], [529, 819], [529, 894], [529, 1043], [529, 1137], [529, 1204], [529, 1311], [532, 797], [533, 822], [534, 832], [535, 163], [535, 651], [535, 1033], [536, 224], [536, 1287], [537, 1227], [537, 1228], [538, 529], [539, 124], [539, 347], [539, 747], [541, 752], [542, 1274], [543, 365], [545, 651], [545, 840], [545, 1064], [546, 30], [546, 95], [546, 125], [546, 128], [546, 1077], [546, 1336], [547, 472], [549, 88], [549, 604], [549, 1348], [550, 884], [550, 1098], [550, 1318], [550, 1359], [551, 465], [551, 814], [552, 684], [553, 459], [553, 761], [553, 1351], [554, 485], [554, 725], [555, 841], [555, 1018], [555, 1019], [555, 1093], [555, 1095], [555, 1096], [555, 1382], [556, 266], [556, 1220], [557, 1027], [559, 1118], [560, 188], [560, 365], [560, 711], [560, 825], [560, 1238], [561, 555], [561, 741], [562, 1212], [563, 470], [563, 847], [564, 723], [566, 915], [566, 1269], [568, 7], [568, 117], [568, 402], [568, 632], [568, 649], [568, 782], [568, 831], [568, 1071], [568, 1295], [570, 89], [570, 90], [570, 562], [570, 668], [570, 739], [570, 765], [570, 926], [570, 1009], [570, 1171], [570, 1288], [570, 1331], [570, 1361], [571, 132], [571, 818], [571, 985], [571, 987], [572, 990], [573, 1272], [576, 65], [576, 1282], [577, 824], [578, 477], [579, 867], [580, 697], [581, 82], [581, 958], [581, 1183], [582, 1179], [583, 197], [583, 1135], [584, 1081], [585, 422], [586, 853], [587, 1269], [588, 1084], [588, 1094], [588, 1295], [589, 229], [589, 402], [589, 756], [589, 782], [589, 783], [589, 862], [589, 1165], [590, 1123], [591, 243], [591, 1025], [591, 1071], [592, 216], [593, 159], [593, 188], [593, 362], [593, 365], [594, 485], [594, 725], [595, 365], [596, 453], [596, 1331], [597, 1025], [598, 594], [599, 62], [599, 1024], [601, 6], [601, 892], [601, 1321], [602, 962], [606, 461], [606, 1157], [606, 1341], [606, 1342], [607, 1070], [608, 461], [608, 1157], [608, 1342], [609, 15], [609, 132], [609, 729], [609, 788], [609, 1055], [609, 1236], [610, 296], [611, 897], [612, 550], [612, 1161], [613, 425], [613, 737], [614, 753], [615, 19], [615, 159], [615, 188], [615, 365], [616, 1168], [617, 38], [618, 1066], [619, 604], [620, 1273], [621, 787], [622, 973], [623, 782], [626, 1270], [627, 130], [628, 1084], [628, 1094], [628, 1295], [629, 224], [629, 1287], [630, 24], [630, 233], [630, 1027], [630, 1066], [630, 1067], [630, 1076], [632, 47], [633, 428], [633, 458], [633, 987], [634, 1129], [635, 816], [636, 770], [637, 465], [638, 503], [639, 910], [640, 308], [640, 848], [640, 1089], [640, 1103], [642, 27], [642, 494], [642, 611], [642, 728], [642, 829], [643, 124], [643, 347], [643, 747], [644, 848], [644, 893], [644, 929], [644, 945], [645, 49], [645, 55], [645, 144], [645, 251], [645, 907], [645, 908], [645, 909], [646, 779], [646, 1028], [646, 1037], [647, 224], [647, 1287], [648, 795], [649, 139], [649, 232], [649, 248], [649, 884], [649, 1098], [649, 1174], [649, 1289], [649, 1318], [649, 1359], [650, 1025], [650, 1287], [651, 816], [652, 985], [655, 27], [655, 365], [655, 651], [655, 728], [656, 196], [657, 22], [657, 356], [657, 567], [657, 641], [657, 659], [657, 662], [657, 664], [657, 667], [657, 668], [657, 717], [657, 732], [657, 761], [657, 811], [657, 827], [657, 832], [657, 833], [657, 877], [657, 896], [657, 953], [657, 1151], [657, 1155], [657, 1157], [657, 1221], [657, 1252], [657, 1267], [657, 1271], [657, 1272], [657, 1307], [657, 1349], [658, 1286], [659, 388], [660, 25], [660, 172], [660, 176], [660, 293], [660, 294], [660, 386], [661, 88], [661, 687], [661, 761], [661, 985], [661, 1348], [662, 725], [663, 1070], [664, 188], [664, 201], [664, 362], [664, 993], [666, 1070], [667, 453], [667, 1331], [668, 1049], [668, 1131], [668, 1237], [669, 369], [669, 450], [669, 560], [669, 1000], [670, 984], [671, 247], [672, 22], [672, 355], [672, 827], [672, 877], [672, 899], [672, 1349], [673, 1339], [675, 131], [676, 782], [677, 475], [677, 831], [677, 922], [677, 1094], [678, 572], [679, 134], [679, 280], [679, 690], [679, 1287], [680, 115], [680, 363], [680, 858], [680, 1119], [681, 155], [682, 787], [683, 1097], [684, 88], [684, 604], [684, 1348], [685, 63], [686, 21], [686, 191], [686, 192], [686, 193], [686, 376], [686, 605], [686, 729], [686, 938], [686, 1190], [686, 1333], [687, 549], [688, 1168], [689, 1346], [690, 3], [690, 53], [690, 220], [690, 232], [690, 711], [690, 725], [690, 824], [690, 875], [690, 907], [690, 930], [690, 1051], [690, 1098], [690, 1318], [691, 477], [691, 741], [691, 974], [692, 22], [692, 827], [692, 877], [692, 1349], [694, 1052], [695, 159], [695, 188], [696, 89], [696, 90], [696, 562], [696, 668], [696, 739], [696, 765], [696, 926], [696, 1009], [696, 1171], [696, 1288], [696, 1331], [696, 1361], [697, 821], [697, 877], [697, 910], [697, 962], [697, 1225], [698, 365], [698, 1015], [699, 1094], [700, 634], [701, 1114], [702, 50], [703, 388], [704, 923], [705, 607], [706, 816], [706, 1015], [708, 921], [710, 49], [710, 723], [710, 735], [710, 761], [710, 985], [710, 1348], [710, 1363], [710, 1364], [711, 297], [711, 1051], [711, 1221], [712, 592], [712, 869], [712, 973], [712, 1059], [713, 1118], [714, 795], [715, 1382], [716, 365], [716, 752], [716, 1295], [717, 7], [717, 117], [717, 182], [717, 242], [717, 265], [717, 387], [717, 402], [717, 448], [717, 449], [717, 451], [717, 470], [717, 649], [717, 705], [717, 748], [717, 782], [717, 894], [717, 911], [717, 941], [717, 974], [717, 1043], [717, 1137], [717, 1204], [717, 1355], [718, 49], [718, 185], [720, 1346], [722, 245], [722, 1311], [723, 365], [723, 1230], [724, 622], [726, 373], [726, 1165], [727, 352], [728, 651], [728, 840], [728, 875], [728, 1070], [729, 159], [729, 188], [730, 585], [732, 962], [733, 355], [733, 357], [733, 523], [733, 838], [733, 877], [733, 899], [733, 1015], [733, 1112], [733, 1229], [734, 764], [734, 953], [734, 1059], [735, 1168], [735, 1262], [736, 816], [736, 1015], [737, 482], [737, 484], [737, 516], [737, 531], [737, 566], [737, 635], [737, 790], [737, 803], [737, 869], [737, 871], [737, 873], [737, 916], [737, 929], [737, 985], [737, 989], [737, 1046], [737, 1219], [737, 1365], [738, 25], [738, 245], [738, 269], [738, 351], [738, 524], [738, 540], [738, 778], [738, 1082], [738, 1283], [738, 1324], [738, 1325], [738, 1326], [739, 915], [740, 217], [741, 88], [741, 604], [741, 1348], [742, 841], [743, 294], [744, 889], [745, 296], [746, 571], [746, 978], [747, 339], [748, 168], [748, 870], [749, 119], [749, 480], [749, 896], [749, 1071], [750, 1342], [751, 723], [752, 307], [753, 551], [753, 819], [753, 864], [753, 894], [753, 1311], [754, 232], [754, 907], [754, 930], [754, 1098], [754, 1318], [755, 365], [756, 632], [757, 1342], [759, 85], [759, 156], [759, 175], [759, 243], [759, 297], [759, 567], [759, 641], [759, 714], [759, 715], [759, 716], [759, 869], [759, 877], [759, 953], [759, 973], [759, 991], [759, 1051], [759, 1059], [759, 1085], [759, 1221], [759, 1271], [759, 1272], [760, 1063], [761, 570], [761, 1342], [762, 833], [763, 816], [763, 1015], [764, 268], [765, 323], [765, 1070], [767, 185], [767, 470], [767, 828], [767, 967], [767, 985], [767, 1165], [767, 1176], [768, 861], [769, 467], [769, 468], [770, 1070], [771, 44], [771, 69], [771, 76], [771, 120], [771, 458], [771, 488], [771, 639], [771, 958], [771, 1024], [771, 1086], [771, 1101], [771, 1189], [771, 1250], [771, 1263], [771, 1264], [771, 1383], [772, 816], [772, 1007], [772, 1015], [773, 775], [775, 910], [776, 905], [776, 1060], [776, 1076], [777, 224], [777, 1287], [778, 168], [778, 870], [780, 296], [781, 482], [781, 484], [781, 516], [781, 531], [781, 566], [781, 635], [781, 790], [781, 803], [781, 869], [781, 871], [781, 873], [781, 916], [781, 929], [781, 985], [781, 989], [781, 1046], [781, 1219], [781, 1365], [782, 5], [782, 75], [782, 129], [782, 180], [782, 228], [782, 237], [782, 408], [782, 591], [782, 599], [782, 600], [782, 743], [782, 760], [782, 786], [782, 808], [782, 886], [782, 887], [782, 934], [782, 1013], [782, 1113], [783, 816], [783, 1015], [784, 578], [784, 848], [784, 1124], [785, 365], [785, 1288], [786, 651], [787, 31], [787, 564], [787, 1018], [788, 156], [788, 869], [788, 973], [788, 1059], [789, 1352], [790, 168], [790, 870], [791, 330], [792, 240], [792, 1258], [792, 1265], [793, 89], [793, 90], [793, 562], [793, 668], [793, 739], [793, 765], [793, 926], [793, 1009], [793, 1171], [793, 1288], [793, 1331], [793, 1361], [799, 1070], [800, 787], [800, 859], [801, 48], [801, 352], [802, 5], [802, 232], [802, 1146], [804, 147], [805, 1116], [806, 652], [807, 62], [807, 222], [807, 227], [807, 407], [807, 477], [807, 551], [807, 607], [807, 630], [807, 686], [807, 819], [807, 820], [807, 830], [807, 864], [807, 894], [807, 895], [807, 1137], [807, 1204], [807, 1284], [807, 1311], [808, 1342], [809, 293], [809, 351], [809, 365], [809, 503], [809, 727], [809, 1125], [810, 125], [810, 128], [810, 1077], [811, 987], [812, 1352], [813, 461], [813, 1157], [813, 1342], [814, 377], [814, 518], [814, 690], [815, 516], [815, 635], [815, 803], [815, 871], [815, 873], [815, 989], [815, 1365], [817, 155], [818, 119], [818, 365], [818, 652], [818, 1009], [819, 156], [820, 181], [821, 155], [823, 578], [823, 641], [824, 985], [825, 365], [826, 384], [826, 624], [826, 1132], [826, 1287], [827, 967], [828, 1070], [829, 957], [830, 1352], [831, 146], [831, 941], [832, 1216], [833, 388], [834, 1179], [835, 36], [835, 49], [835, 158], [835, 191], [835, 1120], [835, 1121], [835, 1186], [835, 1190], [835, 1236], [836, 170], [836, 385], [837, 237], [837, 786], [837, 886], [837, 887], [838, 359], [839, 802], [840, 723], [840, 985], [841, 585], [843, 1152], [844, 48], [844, 352], [845, 41], [846, 1071], [847, 232], [847, 907], [847, 930], [847, 1098], [847, 1318], [848, 32], [850, 54], [850, 1123], [851, 362], [852, 838], [852, 911], [853, 425], [853, 534], [854, 22], [854, 100], [854, 827], [854, 877], [854, 1349], [855, 197], [855, 1131], [856, 624], [858, 165], [858, 478], [858, 670], [858, 685], [858, 843], [858, 897], [858, 1170], [859, 531], [859, 815], [859, 945], [859, 1040], [859, 1046], [859, 1304], [861, 1301], [862, 832], [863, 696], [864, 1099], [865, 384], [866, 344], [866, 568], [867, 352], [868, 696], [869, 822], [869, 1240], [869, 1241], [869, 1242], [870, 365], [870, 824], [870, 1053], [870, 1373], [871, 293], [871, 345], [871, 365], [871, 503], [871, 622], [871, 1320], [872, 254], [872, 752], [874, 503], [875, 1212], [876, 745], [877, 608], [877, 752], [878, 6], [880, 159], [880, 188], [881, 384], [882, 1152], [883, 14], [883, 49], [883, 53], [883, 94], [883, 132], [883, 153], [883, 187], [883, 193], [883, 225], [883, 249], [883, 355], [883, 357], [883, 383], [883, 413], [883, 417], [883, 448], [883, 449], [883, 451], [883, 454], [883, 476], [883, 495], [883, 523], [883, 585], [883, 634], [883, 697], [883, 699], [883, 745], [883, 746], [883, 749], [883, 816], [883, 875], [883, 877], [883, 890], [883, 911], [883, 933], [883, 943], [883, 1015], [883, 1023], [883, 1087], [883, 1091], [883, 1140], [883, 1171], [883, 1229], [883, 1332], [883, 1372], [885, 664], [885, 833], [886, 1097], [887, 388], [888, 1018], [889, 365], [889, 1385], [891, 78], [892, 317], [893, 816], [895, 1007], [896, 1074], [897, 475], [897, 633], [897, 1094], [897, 1295], [898, 836], [898, 1385], [899, 454], [899, 758], [899, 815], [899, 929], [899, 945], [899, 1140], [899, 1235], [900, 25], [900, 245], [900, 269], [900, 351], [900, 524], [900, 540], [900, 778], [900, 1082], [900, 1283], [900, 1324], [900, 1325], [900, 1326], [901, 840], [901, 1070], [902, 511], [903, 657], [903, 689], [905, 973], [906, 828], [907, 356], [907, 567], [907, 641], [907, 659], [907, 662], [907, 664], [907, 667], [907, 668], [907, 717], [907, 732], [907, 761], [907, 811], [907, 832], [907, 833], [907, 896], [907, 953], [907, 1151], [907, 1155], [907, 1157], [907, 1221], [907, 1252], [907, 1267], [907, 1271], [907, 1272], [907, 1307], [908, 1151], [909, 1183], [910, 503], [913, 7], [913, 117], [913, 402], [913, 649], [913, 782], [914, 1070], [915, 258], [915, 365], [916, 896], [917, 1274], [918, 1126], [918, 1352], [919, 752], [919, 1070], [919, 1379], [920, 1231], [921, 565], [921, 566], [921, 781], [921, 869], [921, 871], [921, 973], [921, 985], [921, 1059], [921, 1148], [922, 1177], [923, 841], [924, 365], [924, 728], [925, 209], [925, 359], [926, 1352], [927, 3], [927, 53], [927, 220], [927, 232], [927, 711], [927, 725], [927, 824], [927, 875], [927, 907], [927, 930], [927, 1051], [927, 1098], [927, 1318], [928, 1037], [929, 905], [929, 1060], [929, 1131], [930, 419], [930, 477], [930, 485], [930, 619], [930, 726], [930, 754], [930, 897], [930, 911], [930, 967], [930, 982], [930, 1109], [930, 1111], [930, 1161], [931, 816], [931, 1015], [932, 846], [933, 840], [935, 81], [936, 461], [936, 1157], [936, 1341], [936, 1342], [937, 153], [938, 30], [938, 95], [938, 125], [938, 128], [938, 1077], [938, 1336], [940, 365], [940, 494], [941, 247], [942, 461], [942, 1157], [942, 1342], [943, 296], [944, 50], [944, 262], [944, 742], [944, 964], [944, 1199], [945, 49], [945, 94], [945, 106], [945, 308], [945, 403], [945, 848], [945, 929], [945, 1103], [946, 684], [947, 570], [948, 365], [948, 816], [949, 616], [950, 353], [950, 728], [950, 822], [951, 696], [954, 132], [955, 735], [955, 761], [955, 985], [955, 1348], [955, 1363], [955, 1364], [956, 1077], [956, 1336], [957, 921], [958, 150], [958, 854], [959, 320], [959, 633], [959, 773], [959, 831], [959, 1386], [960, 7], [960, 117], [960, 402], [960, 649], [960, 782], [961, 89], [961, 90], [961, 562], [961, 668], [961, 739], [961, 765], [961, 926], [961, 1009], [961, 1171], [961, 1288], [961, 1331], [961, 1361], [962, 882], [963, 1094], [963, 1224], [964, 728], [965, 251], [965, 1342], [966, 365], [966, 752], [966, 1070], [968, 304], [969, 770], [970, 266], [970, 383], [971, 89], [971, 90], [971, 562], [971, 668], [971, 739], [971, 765], [971, 926], [971, 1009], [971, 1171], [971, 1288], [971, 1331], [971, 1361], [972, 2], [972, 62], [972, 272], [972, 487], [972, 827], [972, 1339], [973, 75], [973, 505], [973, 506], [973, 840], [973, 1113], [973, 1261], [974, 1014], [974, 1097], [975, 185], [975, 465], [975, 493], [975, 895], [975, 928], [975, 985], [975, 1023], [975, 1079], [975, 1168], [977, 735], [977, 753], [977, 761], [977, 985], [977, 1348], [977, 1363], [977, 1364], [978, 619], [979, 1070], [980, 417], [980, 739], [981, 753], [981, 1341], [982, 24], [982, 233], [982, 1027], [982, 1066], [982, 1067], [982, 1076], [983, 732], [983, 764], [983, 877], [983, 1151], [983, 1169], [984, 388], [986, 134], [987, 749], [988, 753], [989, 983], [990, 1302], [991, 1269], [992, 504], [993, 628], [993, 693], [993, 839], [994, 1230], [994, 1342], [995, 425], [995, 737], [995, 851], [996, 979], [997, 1342], [998, 1183], [999, 987], [1000, 776], [1001, 871], [1002, 134], [1002, 1057], [1002, 1286], [1003, 62], [1003, 155], [1004, 100], [1005, 985], [1006, 707], [1006, 858], [1006, 876], [1006, 894], [1006, 941], [1006, 1060], [1006, 1275], [1007, 729], [1007, 788], [1009, 380], [1009, 1287], [1010, 1076], [1011, 1270], [1014, 146], [1014, 941], [1015, 816], [1015, 1015], [1016, 447], [1016, 593], [1017, 604], [1018, 89], [1018, 90], [1018, 562], [1018, 668], [1018, 739], [1018, 765], [1018, 926], [1018, 1009], [1018, 1171], [1018, 1288], [1018, 1331], [1018, 1361], [1019, 1268], [1020, 967], [1021, 904], [1022, 1225], [1023, 188], [1023, 201], [1023, 362], [1023, 993], [1024, 191], [1025, 34], [1025, 353], [1025, 363], [1025, 424], [1025, 425], [1025, 695], [1025, 707], [1025, 759], [1025, 1060], [1025, 1260], [1025, 1275], [1025, 1350], [1027, 159], [1027, 188], [1029, 63], [1030, 365], [1031, 242], [1031, 551], [1031, 819], [1031, 894], [1031, 1043], [1031, 1137], [1031, 1204], [1031, 1311], [1032, 1177], [1033, 158], [1034, 723], [1035, 1099], [1035, 1296], [1035, 1322], [1036, 962], [1037, 20], [1038, 1123], [1039, 1203], [1040, 633], [1040, 1295], [1041, 1331], [1044, 1015], [1045, 185], [1045, 470], [1045, 602], [1045, 720], [1045, 828], [1045, 967], [1045, 985], [1045, 1165], [1045, 1176], [1046, 209], [1047, 69], [1047, 232], [1047, 771], [1047, 1098], [1047, 1111], [1048, 422], [1048, 744], [1049, 41], [1049, 58], [1049, 60], [1049, 144], [1049, 171], [1049, 636], [1049, 852], [1049, 1083], [1049, 1184], [1049, 1185], [1049, 1200], [1049, 1201], [1049, 1323], [1050, 62], [1050, 222], [1050, 227], [1050, 407], [1050, 477], [1050, 551], [1050, 607], [1050, 630], [1050, 686], [1050, 819], [1050, 820], [1050, 830], [1050, 864], [1050, 894], [1050, 895], [1050, 1137], [1050, 1204], [1050, 1284], [1050, 1311], [1052, 735], [1052, 753], [1052, 761], [1052, 1348], [1052, 1363], [1052, 1364], [1053, 821], [1053, 877], [1053, 910], [1053, 962], [1053, 1225], [1054, 7], [1054, 117], [1054, 402], [1054, 649], [1054, 782], [1055, 330], [1055, 785], [1056, 923], [1056, 1092], [1056, 1150], [1057, 365], [1057, 611], [1057, 1183], [1058, 1179], [1059, 472], [1060, 454], [1060, 523], [1060, 848], [1060, 929], [1060, 945], [1060, 1103], [1060, 1140], [1060, 1235], [1061, 15], [1061, 92], [1061, 279], [1061, 532], [1061, 685], [1061, 724], [1061, 846], [1061, 1011], [1061, 1118], [1061, 1209], [1061, 1250], [1062, 1251], [1063, 696], [1064, 601], [1066, 224], [1066, 1287], [1067, 137], [1069, 365], [1070, 1070], [1071, 365], [1073, 23], [1073, 144], [1073, 251], [1073, 428], [1073, 804], [1073, 1256], [1074, 616], [1075, 330], [1076, 410], [1077, 482], [1077, 484], [1077, 516], [1077, 531], [1077, 635], [1077, 790], [1077, 803], [1077, 871], [1077, 873], [1077, 916], [1077, 989], [1077, 1046], [1077, 1219], [1077, 1365], [1078, 277], [1078, 809], [1079, 527], [1080, 5], [1080, 75], [1080, 387], [1080, 924], [1080, 986], [1080, 1041], [1080, 1086], [1080, 1113], [1080, 1191], [1080, 1367], [1081, 22], [1081, 827], [1081, 877], [1081, 1349], [1082, 1342], [1083, 244], [1083, 475], [1083, 1052], [1083, 1094], [1085, 306], [1085, 761], [1086, 882], [1087, 89], [1088, 921], [1091, 63], [1093, 816], [1093, 1007], [1093, 1015], [1094, 34], [1094, 353], [1094, 363], [1094, 424], [1094, 425], [1094, 695], [1094, 707], [1094, 759], [1094, 1060], [1094, 1260], [1094, 1275], [1094, 1350], [1095, 25], [1095, 245], [1095, 1285], [1097, 250], [1098, 89], [1098, 90], [1098, 562], [1098, 668], [1098, 739], [1098, 765], [1098, 926], [1098, 1009], [1098, 1171], [1098, 1288], [1098, 1331], [1098, 1361], [1100, 477], [1101, 229], [1101, 472], [1101, 782], [1101, 783], [1102, 1262], [1103, 365], [1104, 777], [1105, 153], [1105, 1017], [1106, 365], [1106, 633], [1106, 1295], [1107, 509], [1107, 612], [1108, 145], [1108, 624], [1108, 872], [1108, 879], [1108, 965], [1108, 1331], [1109, 15], [1109, 83], [1109, 159], [1109, 188], [1109, 247], [1109, 642], [1109, 731], [1109, 856], [1109, 1118], [1109, 1368], [1110, 75], [1110, 338], [1110, 500], [1110, 535], [1110, 734], [1110, 1016], [1110, 1104], [1110, 1113], [1111, 159], [1111, 188], [1111, 787], [1112, 227], [1112, 363], [1112, 1237], [1113, 756], [1113, 862], [1113, 1138], [1113, 1165], [1113, 1237], [1114, 1179], [1117, 840], [1118, 49], [1118, 790], [1119, 89], [1119, 90], [1119, 562], [1119, 668], [1119, 739], [1119, 765], [1119, 926], [1119, 1009], [1119, 1171], [1119, 1288], [1119, 1331], [1119, 1361], [1120, 185], [1120, 306], [1120, 761], [1120, 877], [1121, 453], [1121, 1331], [1122, 320], [1122, 633], [1122, 773], [1122, 831], [1122, 1386], [1124, 1296], [1125, 49], [1125, 54], [1125, 428], [1125, 804], [1125, 884], [1125, 1098], [1125, 1256], [1126, 480], [1126, 896], [1126, 1071], [1126, 1347], [1127, 1007], [1128, 365], [1129, 247], [1130, 728], [1130, 856], [1131, 816], [1131, 1015], [1132, 3], [1132, 187], [1132, 220], [1132, 224], [1132, 232], [1132, 532], [1132, 699], [1132, 711], [1132, 725], [1132, 824], [1132, 875], [1132, 890], [1132, 907], [1132, 930], [1132, 1051], [1132, 1053], [1132, 1098], [1132, 1112], [1132, 1263], [1132, 1318], [1132, 1355], [1133, 7], [1133, 49], [1133, 117], [1133, 402], [1133, 649], [1133, 782], [1134, 821], [1134, 877], [1134, 1225], [1135, 266], [1135, 383], [1135, 1087], [1137, 1074], [1138, 146], [1139, 785], [1140, 1269], [1141, 28], [1142, 1015], [1143, 595], [1144, 63], [1145, 243], [1145, 722], [1145, 1025], [1146, 63], [1147, 1183], [1148, 22], [1148, 827], [1148, 877], [1148, 1349], [1149, 296], [1150, 474], [1151, 5], [1151, 75], [1151, 129], [1151, 180], [1151, 228], [1151, 231], [1151, 261], [1151, 299], [1151, 387], [1151, 500], [1151, 559], [1151, 591], [1151, 713], [1151, 760], [1151, 763], [1151, 927], [1151, 1105], [1151, 1113], [1151, 1138], [1152, 30], [1152, 1077], [1153, 137], [1154, 124], [1154, 347], [1154, 747], [1155, 1342], [1156, 1385], [1157, 474], [1158, 821], [1158, 877], [1158, 910], [1158, 962], [1158, 1225], [1161, 117], [1161, 649], [1163, 113], [1163, 214], [1163, 593], [1163, 1126], [1165, 247], [1165, 913], [1166, 45], [1166, 89], [1166, 90], [1166, 562], [1166, 620], [1166, 668], [1166, 739], [1166, 765], [1166, 926], [1166, 1009], [1166, 1171], [1166, 1279], [1166, 1288], [1166, 1331], [1166, 1361], [1167, 8], [1167, 319], [1168, 784], [1169, 2], [1170, 1270], [1171, 985], [1173, 624], [1174, 728], [1175, 1074], [1176, 1183], [1177, 56], [1177, 63], [1177, 224], [1177, 384], [1177, 1179], [1177, 1231], [1177, 1287], [1179, 409], [1180, 1385], [1182, 747], [1183, 971], [1183, 1166], [1184, 607], [1184, 616], [1186, 224], [1186, 1287], [1187, 365], [1188, 362], [1189, 409], [1190, 384], [1190, 1287], [1191, 22], [1191, 827], [1191, 877], [1191, 1349], [1192, 269], [1193, 120], [1194, 243], [1194, 419], [1194, 1025], [1194, 1032], [1195, 35], [1195, 159], [1195, 188], [1195, 362], [1195, 475], [1195, 1094], [1197, 696], [1198, 504], [1201, 1007], [1202, 619], [1203, 1014], [1204, 129], [1206, 896], [1206, 1188], [1207, 453], [1207, 1280], [1208, 89], [1208, 90], [1208, 562], [1208, 668], [1208, 739], [1208, 765], [1208, 926], [1208, 1009], [1208, 1171], [1208, 1288], [1208, 1331], [1208, 1361], [1210, 226], [1211, 790], [1211, 871], [1211, 873], [1212, 163], [1212, 224], [1212, 362], [1212, 365], [1212, 375], [1212, 416], [1212, 417], [1212, 443], [1212, 651], [1212, 944], [1212, 1287], [1213, 1099], [1214, 356], [1215, 461], [1215, 1157], [1215, 1342], [1216, 1183], [1217, 149], [1217, 769], [1218, 1099], [1218, 1322], [1219, 185], [1219, 470], [1219, 828], [1219, 967], [1219, 985], [1219, 1165], [1219, 1176], [1220, 863], [1220, 1042], [1221, 867], [1222, 73], [1222, 191], [1222, 352], [1222, 452], [1222, 550], [1222, 651], [1222, 697], [1222, 842], [1222, 943], [1222, 1091], [1222, 1110], [1222, 1112], [1224, 146], [1224, 941], [1225, 88], [1225, 687], [1225, 761], [1225, 985], [1225, 1348], [1226, 741], [1227, 40], [1227, 42], [1227, 276], [1227, 349], [1227, 537], [1227, 599], [1227, 651], [1227, 721], [1227, 807], [1227, 840], [1227, 937], [1227, 986], [1227, 1001], [1227, 1007], [1227, 1041], [1227, 1068], [1227, 1112], [1227, 1122], [1227, 1181], [1227, 1189], [1227, 1259], [1227, 1297], [1227, 1367], [1228, 1070], [1229, 453], [1229, 1331], [1230, 1269], [1231, 1110], [1233, 14], [1233, 49], [1233, 53], [1233, 94], [1233, 132], [1233, 153], [1233, 187], [1233, 193], [1233, 225], [1233, 249], [1233, 355], [1233, 357], [1233, 383], [1233, 413], [1233, 417], [1233, 448], [1233, 449], [1233, 451], [1233, 454], [1233, 476], [1233, 495], [1233, 523], [1233, 585], [1233, 634], [1233, 697], [1233, 699], [1233, 745], [1233, 746], [1233, 749], [1233, 816], [1233, 875], [1233, 877], [1233, 890], [1233, 911], [1233, 933], [1233, 943], [1233, 1015], [1233, 1023], [1233, 1087], [1233, 1091], [1233, 1140], [1233, 1171], [1233, 1229], [1233, 1332], [1233, 1372], [1234, 728], [1235, 862], [1236, 946], [1237, 3], [1238, 757], [1238, 788], [1238, 845], [1239, 1342], [1240, 320], [1240, 783], [1240, 1165], [1241, 837], [1242, 404], [1243, 391], [1245, 1014], [1246, 365], [1247, 255], [1247, 785], [1248, 425], [1248, 737], [1249, 571], [1249, 1158], [1250, 75], [1250, 505], [1250, 506], [1250, 840], [1250, 1113], [1250, 1261], [1251, 723], [1252, 845], [1253, 1013], [1254, 89], [1254, 90], [1254, 562], [1254, 668], [1254, 739], [1254, 765], [1254, 926], [1254, 1009], [1254, 1171], [1254, 1288], [1254, 1331], [1254, 1361], [1255, 117], [1255, 649], [1256, 124], [1256, 347], [1256, 747], [1257, 1015], [1258, 664], [1258, 833], [1260, 404], [1260, 593], [1260, 1309], [1261, 631], [1261, 1295], [1262, 92], [1262, 478], [1262, 769], [1262, 1011], [1262, 1208], [1262, 1236], [1263, 1023], [1265, 141], [1266, 27], [1266, 629], [1266, 854], [1266, 1226], [1267, 222], [1267, 607], [1267, 819], [1267, 1043], [1267, 1137], [1267, 1204], [1269, 550], [1269, 1109], [1269, 1111], [1269, 1112], [1269, 1121], [1271, 359], [1272, 1018], [1273, 87], [1273, 151], [1274, 76], [1274, 78], [1274, 162], [1274, 391], [1274, 613], [1274, 689], [1274, 831], [1274, 846], [1274, 1014], [1274, 1061], [1274, 1073], [1275, 264], [1275, 452], [1275, 651], [1275, 911], [1275, 1022], [1276, 728], [1278, 388], [1278, 985], [1279, 895], [1280, 454], [1280, 758], [1280, 815], [1280, 929], [1280, 945], [1280, 1140], [1280, 1235], [1281, 232], [1281, 388], [1281, 771], [1281, 1098], [1281, 1179], [1282, 39], [1282, 573], [1282, 1078], [1282, 1175], [1282, 1345], [1283, 159], [1283, 188], [1283, 1152], [1284, 1015], [1286, 425], [1286, 737], [1288, 224], [1288, 1287], [1289, 1052], [1289, 1198], [1289, 1375], [1293, 509], [1294, 297], [1295, 723], [1296, 20], [1296, 224], [1296, 1165], [1297, 185], [1297, 306], [1297, 761], [1297, 877], [1298, 707], [1298, 728], [1298, 740], [1300, 1353], [1301, 306], [1302, 893], [1302, 929], [1302, 945], [1302, 1140], [1303, 247], [1304, 267], [1305, 465], [1305, 578], [1306, 14], [1306, 49], [1306, 53], [1306, 94], [1306, 132], [1306, 153], [1306, 187], [1306, 193], [1306, 225], [1306, 249], [1306, 355], [1306, 357], [1306, 365], [1306, 383], [1306, 413], [1306, 417], [1306, 448], [1306, 449], [1306, 451], [1306, 454], [1306, 476], [1306, 495], [1306, 523], [1306, 585], [1306, 634], [1306, 697], [1306, 699], [1306, 745], [1306, 746], [1306, 749], [1306, 816], [1306, 875], [1306, 877], [1306, 890], [1306, 911], [1306, 933], [1306, 943], [1306, 1015], [1306, 1023], [1306, 1087], [1306, 1091], [1306, 1140], [1306, 1171], [1306, 1229], [1306, 1332], [1306, 1372], [1307, 816], [1308, 251], [1308, 603], [1308, 1015], [1310, 365], [1310, 582], [1311, 39], [1313, 836], [1314, 229], [1314, 365], [1314, 1094], [1315, 445], [1315, 739], [1315, 757], [1315, 1276], [1316, 1269], [1317, 1205], [1318, 376], [1318, 419], [1318, 550], [1318, 651], [1318, 814], [1318, 897], [1318, 938], [1318, 1004], [1318, 1091], [1318, 1161], [1319, 631], [1320, 962], [1321, 133], [1321, 797], [1322, 296], [1322, 421], [1322, 423], [1323, 816], [1324, 1123], [1325, 25], [1325, 27], [1326, 92], [1326, 192], [1326, 279], [1326, 471], [1326, 724], [1326, 835], [1326, 1011], [1326, 1209], [1327, 1124], [1328, 159], [1328, 188], [1328, 362], [1328, 365], [1329, 31], [1329, 427], [1329, 564], [1330, 1352], [1331, 267], [1332, 293], [1332, 365], [1332, 921], [1332, 1214], [1334, 365], [1335, 294], [1336, 633], [1336, 1295], [1337, 723], [1338, 633], [1338, 1386], [1339, 1344], [1340, 440], [1341, 1209], [1342, 145], [1342, 624], [1342, 872], [1342, 879], [1342, 965], [1342, 1331], [1343, 296], [1344, 21], [1344, 49], [1344, 477], [1344, 638], [1344, 746], [1345, 453], [1345, 1331], [1346, 88], [1346, 1348], [1347, 384], [1348, 1342], [1349, 1310], [1350, 245], [1350, 1052], [1351, 770], [1352, 1262], [1353, 987], [1354, 22], [1354, 100], [1354, 827], [1354, 877], [1354, 1349], [1355, 695], [1355, 707], [1356, 306], [1356, 761], [1357, 226], [1358, 485], [1358, 725], [1359, 49], [1359, 495], [1359, 1037], [1361, 1342], [1362, 85], [1362, 297], [1362, 465], [1362, 567], [1362, 578], [1362, 641], [1362, 953], [1362, 1111], [1362, 1212], [1364, 461], [1364, 574], [1364, 1267], [1364, 1342], [1365, 565], [1365, 803], [1365, 991], [1365, 992], [1365, 1173], [1366, 474], [1367, 816], [1367, 1015], [1368, 495], [1368, 816], [1368, 1014], [1369, 696], [1370, 365], [1371, 352], [1371, 550], [1371, 848], [1371, 1089], [1371, 1103], [1371, 1121], [1372, 696], [1373, 168], [1373, 870], [1374, 633], [1374, 1386], [1375, 550], [1375, 1161], [1376, 453], [1376, 1331], [1377, 862], [1377, 987], [1378, 565], [1378, 668], [1378, 803], [1378, 953], [1378, 991], [1378, 992], [1378, 1120], [1378, 1173], [1379, 253], [1380, 242], [1380, 551], [1380, 819], [1380, 894], [1380, 1043], [1380, 1204], [1381, 511], [1381, 1076], [1382, 359], [1383, 418], [1383, 464], [1383, 825], [1383, 831], [1383, 1146], [1384, 770], [1385, 146], [1385, 365], [1386, 83], [1386, 159], [1386, 182], [1386, 188], [1386, 247], [1386, 362], [1386, 382], [1386, 460], [1386, 642], [1386, 844], [1386, 856], [1386, 944], [1386, 1107], [1386, 1118], [1386, 1287], [1386, 1368], [1387, 229], [1387, 1094], [1388, 651], [1388, 1064], [1389, 616], [1389, 656], [1390, 453], [1390, 1331], [1391, 45], [1391, 89], [1391, 90], [1391, 453], [1391, 562], [1391, 620], [1391, 668], [1391, 739], [1391, 765], [1391, 926], [1391, 1009], [1391, 1171], [1391, 1279], [1391, 1288], [1391, 1331], [1391, 1361], [1392, 735], [1392, 761], [1392, 985], [1392, 1348], [1392, 1363], [1392, 1364], [1393, 34], [1393, 353], [1393, 363], [1393, 424], [1393, 425], [1393, 695], [1393, 707], [1393, 759], [1393, 1060], [1393, 1260], [1393, 1275], [1393, 1350], [1394, 179], [1396, 141], [1397, 146], [1397, 776], [1397, 941], [1397, 1329], [1399, 75], [1399, 457], [1399, 1113], [1400, 306], [1401, 124], [1401, 347], [1401, 747], [1403, 739], [1404, 1124], [1405, 3], [1405, 44], [1405, 75], [1405, 232], [1405, 328], [1405, 375], [1405, 417], [1405, 443], [1405, 898], [1405, 1318], [1406, 384], [1407, 62], [1407, 501], [1407, 846], [1407, 851], [1407, 1024], [1408, 608], [1408, 752], [1409, 196], [1410, 88], [1410, 1348], [1411, 49], [1411, 1023], [1412, 309], [1412, 365], [1412, 516], [1412, 635], [1412, 1342], [1413, 63], [1413, 92], [1413, 224], [1413, 380], [1413, 670], [1413, 981], [1413, 1007], [1413, 1011], [1413, 1101], [1413, 1179], [1413, 1208], [1413, 1212], [1413, 1236], [1413, 1287], [1414, 365], [1416, 246], [1416, 1274], [1417, 825], [1417, 1142], [1417, 1198], [1418, 115], [1419, 132], [1419, 485], [1419, 725], [1420, 787], [1421, 633], [1421, 1386], [1422, 299], [1422, 365], [1422, 370], [1422, 682], [1422, 841], [1422, 974], [1422, 1018], [1422, 1019], [1422, 1093], [1422, 1095], [1422, 1096], [1422, 1230], [1423, 362], [1424, 728], [1425, 52], [1425, 65], [1425, 81], [1425, 92], [1425, 380], [1425, 641], [1425, 670], [1425, 985], [1425, 1011], [1425, 1101], [1425, 1208], [1425, 1212], [1426, 782], [1429, 461], [1429, 574], [1429, 664], [1429, 1342], [1430, 1168], [1430, 1262], [1431, 5], [1431, 75], [1431, 129], [1431, 180], [1431, 228], [1431, 237], [1431, 408], [1431, 591], [1431, 599], [1431, 600], [1431, 743], [1431, 760], [1431, 786], [1431, 886], [1431, 887], [1431, 934], [1431, 1013], [1431, 1113], [1432, 229], [1433, 56], [1433, 224], [1433, 352], [1433, 384], [1433, 419], [1433, 814], [1433, 1179], [1433, 1231], [1433, 1287], [1434, 651], [1435, 787], [1436, 453], [1436, 1331], [1437, 376], [1437, 419], [1437, 550], [1437, 651], [1437, 814], [1437, 897], [1437, 938], [1437, 1004], [1437, 1091], [1437, 1161], [1438, 269], [1439, 453], [1439, 1331], [1440, 156], [1440, 243], [1440, 297], [1440, 641], [1440, 714], [1440, 715], [1440, 716], [1440, 953], [1440, 991], [1440, 1051], [1440, 1272], [1442, 56], [1442, 224], [1442, 356], [1442, 384], [1442, 1179], [1442, 1231], [1442, 1287], [1443, 21], [1443, 41], [1443, 477], [1443, 638], [1443, 938], [1444, 229], [1444, 632], [1445, 631], [1445, 756], [1445, 862], [1446, 660], [1447, 696], [1448, 910], [1449, 585], [1450, 1287], [1451, 52], [1451, 63], [1451, 81], [1451, 100], [1451, 132], [1451, 419], [1451, 485], [1451, 659], [1451, 703], [1451, 704], [1451, 766], [1451, 792], [1451, 793], [1451, 814], [1451, 869], [1451, 889], [1451, 897], [1451, 950], [1451, 972], [1451, 973], [1451, 1059], [1451, 1111], [1451, 